# OwnerFamily Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..OwnerFamily Property
Document Class Example See Also
---
Get the Family of this Family Document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Family OwnerFamily { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OwnerFamily As Family
	Get
```

Visual C++
---
```text
public:
property Family^ OwnerFamily {
	Family^ get ();
}
```

# Remarks
Only available if the current document is family document.
# Examples
CopyC#
```text
string categoryName = familyDoc.OwnerFamily.FamilyCategory.Name;
```

CopyVB.NET
```text
Dim categoryName As String = familyDoc.OwnerFamily.FamilyCategory.Name
```

# See Also
Document Class
Autodesk.Revit.DB Namespace